---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetVCurveNormalAtStation(System.Double)
source: html/6707e224-ba1d-f1f8-8d61-9545762f6c55.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetVCurveNormalAtStation Method

Calculate 2d (X and Y components of returned vector) vertical normal at given station.

## Syntax (C#)
```csharp
public XYZ GetVCurveNormalAtStation(
	double station
)
```

## Parameters
- **station** (`System.Double`) - Alignment station to calculate 2d vertical normal for, in Revit internal model units (standard Imperial feet).

## Returns
2d (X and Y components of returned vector) vertical normal at given station.